# GetDLComponentFill

## Description
Gets the fill of the component at index in the Double Line Preferences.

```pascal
FUNCTION GetDLComponentFill(
				index    : INTEGER;
				VAR fill : LONGINT): BOOLEAN;
```

```python
def vs.GetDLComponentFill(index):
    return (BOOLEAN, fill)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|index|INTEGER|The index of the component.|
|fill|LONGINT|Returns the fill of the component.  Positive values for patterns, negative ref numbers for hatches.|

## Remarks
CJG 6-27-06

## Examples
```pascal
resultOK := GetDLComponentFill(1, 2);
```
```python
import vs

# Gets the fill of the component at index in the Double Line Preferences.
index = 1

ok, fill = vs.GetDLComponentFill(index)
vs.Message('GetDLComponentFill returned: ' + str((ok, fill)))
```

## See Also
VS Functions:
SetDLComponentFill

## Version
Availability: from VectorWorks12.5

## Category
* Document Settings